Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་གིས་སྨྲས་པ། གངས་ཀྱི་ངོས་དང་ཉེ་བ་དང་། དྲང་སྲོང་སེར་སྐྱའི་དཀའ་ཐུབ་ཀྱི་གནས་ནས་ཐག་མི་རིང་བ་ཞིག་ཏུ་ཤཱཀྱའི་བུ་ཞིག་སྐྱེས་ནས
en: “At the foot of the Himalayas, not far from the hermitage of the sage Kapila, a child was born to the Śākyas,” they explained.

source: དེ་བྲམ་ཟེ་མཚན་མཁན་བྱེ་བྲག་ཕྱེད་པ་དག་གིས་ལུང་བསྟན་པ།
en: “The brahmin sign tellers and augurs predicted,

source: གལ་ཏེ་འདི་ཁྱིམ་ན་གནས་ན་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་རོ། །
en: ‘If he remains here at home, he will become a universal monarch,

source: གལ་ཏེ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་ཆོས་གོས་ཚོན་ཅན་གྱོན་ཏེ་ཡང་དག་པའི་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ན་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་ཏེགྲགས་པ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ་ཞེས་བྱས་ནས།
en: but if he shaves his head and face and dons the colorful religious robes, and if with nothing short of perfect faith he goes forth from home to live as a mendicant, then he will be renowned throughout the world as a tathāgata, an arhat, a totally and completely awakened buddha.’ ”

source: དེ་ཐོས་མ་ཐག་ཏུ་དེ་བཅོམ་ལྡན་འདས་ལ་ལྟ་འདོད་པར་གྱུར་ཏེ།
en: As soon as the young brahmin heard this, he was eager to meet the Blessed One.

source: དེ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས་གཡོག་བྱས་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་དོང་ངོ་། །
en: Accompanied by the great crowd he went to the garden of Prince Jeta,

source: དེ་ནས་ཁྱེའུ་འཕྱེ་བོ་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ།
en: Young Paṅgu saw the Blessed One from a distance. His body, graced and resplendent with the thirty-two signs of a great person,

source: མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ།
en: looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་སངས་རྒྱས་ལ་གུས་པའི་ཕྱིར་ཁྱོགས་ལས་བབས་ཏེ། གཟུགས་བཞིས་འཕྱེ་ཞིང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: After seeing him he descended from the palanquin in reverence toward the Buddha, crawled on four limbs before the Blessed One, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་འཕྱེ་བོ་དེས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When he heard it, Paṅgu destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: གལ་ཏེ་བདག་གི་ལུས་འདི་འདྲ་བར་མ་གྱུར་དུ་ཟིན་ན་བདག་ཀྱང་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཆུ་བོ་རྣམས་ལས་བརྒལ་བར་བྱ་བ་དང་། སྦྱོར་བ་རྣམས་ལས་འདའ་བར་བྱ་བའི་ཕྱིར་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པར་བྱ་བ་ཞིག་གུ་སྙམ་མོ། །
en: “If my body weren’t like this, I too would go forth in the Dharma and Vinaya so well spoken, to ford the floodwaters and completely escape my fetters with diligence, practice, and effort.”

source: དེ་ནས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་དེའི་ལུས་ཀྱི་ཡན་ལག་རངས་པར་གྱུར་ཏོ། །
en: No sooner had he thought this than the limbs of his body were made whole.

source: དེ་ནས་དེ་ལྷག་པར་ཡང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: As he rejoiced, he was especially filled with joy toward the Blessed One.

source: དགའ་བར་གྱུར་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: In his joy he rose from his seat, drew down the right shoulder of his upper garment, and asked the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་ནས་བསྙེན་པར་རྫོགས་པར་མཛད་དེ།
en: With the words “Come, join me, monk! Practice the holy life,” the Blessed One led him to go forth as a novice, conferred on him full ordination,

source: སྲིད་པའི་རྙེད་པ་དང་། ཆགས་པ་དང་། བཀུར་སྟི་ལ་མི་ལྟ་བ། དབང་པོ་དང་།
en: He had no regard for worldly profit, passion, or acclaim.

source: ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་འཕྱེ་བོས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord,” the monks asked the Blessed Buddha, “what action did Paṅgu take that ripened into his birth into a family of great means, prosperity, and wealth?

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་འཕྱེ་བོར་གྱུར་ལ།
en: What action did he take that ripened into his becoming a paraplegic;

source: འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ལ།
en: that he pleased the Blessed One, and did not displease him;

source: རབ་ཏུ་འབྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་འདིའི་བཀྲ་མི་ཤིས་པ་མ་མཆིས་པར་གྱུར་ནས་བཀྲ་ཤིས་པར་གྱུར་ཏེ།
en: that as soon as he felt a sense of renunciation, his misfortune vanished and he became fortunate instead;

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་ཏེ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་བཱ་རཱ་ཎ་སཱི་ན་དགེ་བསྙེན་མང་དུ་ཐོས་པ། རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བ།
en: there lived a certain lay vow holder in Vārāṇasī who was a very learned proponent of the Dharma with all the eloquence of wisdom and freedom.

source: དགེ་བསྙེན་གྱི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བྱེད། བླ་མར་བྱེད། རི་མོར་བྱེད། མཆོད་པ་བྱེད་པ་ཞིག་གནས་སོ། །
en: All the other lay vow holders held him in high esteem, and revered, honored, and venerated him.

source: དེ་ནས་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་བཱ་རཱ་ཎ་སཱི་ན་གནས་བཅས་ཏེ་
en: “The totally and completely awakened Buddha Kāśyapa had taken up residence in Vārāṇasī,

source: བཞུགས་པ་དེའི་ཚེ་དགེ་བསྙེན་གྱི་སྐྱེ་བོ་རྣམས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཐད་དུ་དོང་སྟེ་ཆོས་མཉན་ཏོ། །
en: and while he was there many lay vow holders came before him to listen to the Dharma.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལྗོངས་དེ་ནས་གུད་དུ་གཤེགས་པ་དེའི་ཚེ་དགེ་བསྙེན་དེ་དག་དགེ་བསྙེན་དེ་ལ་ཆོས་ཉན་ཏོ། །དགེ་བསྙེན་གྱི་སྐྱེ་བོ་དེ་དག་གིས་ཀྱང་དགེ་བསྙེན་དེ་ལ་ཡོན་དུ་ཀཱཪྵཱ་པ་ཎ་ལྔ་བརྒྱ་སྦྱིན་པར་བྱེད་དོ། །
en: Whenever the totally and completely awakened Buddha Kāśyapa traveled from their region to another place, the other lay vow holders would go to listen to the Dharma from that certain lay vow holder in Vārāṇasī. All the other lay vow holders would make a gift of five hundred gold coins to that lay vow holder.

source: དགེ་བསྙེན་དེས་ཀྱང་ཀཱཪྵཱ་པ་ཎ་ལྔ་བརྒྱ་པོ་དེ་དག་དགེ་འདུན་ལ་འབུལ་བར་བྱེད་དོ། །
en: Those lay vow holders would also offer five hundred gold coins to the saṅgha.

source: དེ་ནས་ཕྱི་ཞིག་ན་དགེ་བསྙེན་དེ་དགེ་བསྙེན་གྱི་སྡེ་ཚན་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གཙུག་ལག་ཁང་དུ་དོང་ངོ་། །
en: “One day that lay vow holder went to the monastery with the group of other lay vow holders.

source: དེའི་ཚེ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་འདུལ་བའི་ཆོ་གའི་ལས་བྱ་བ་ཞིག་བྱུང་ནས་གཙུག་ལག་ཁང་སྐྱོང་གིས་དགེ་བསྙེན་ཐམས་ཅད་གཙུག་ལག་ཁང་གི་ཕྱི་རོལ་དུ་བསྐྲད་དེ།
en: The entire saṅgha of monks was performing a monastic ritual, so the caretaker of the monastery sent all the lay vow holders away from the monastery

source: འདི་ཁྱེད་ཀྱིས་མཉན་པར་མ་བྱེད་ཅིག་ཅེས་བྱས་སོ། །
en: and told them they weren’t allowed to listen.

source: དེ་ནས་དགེ་བསྙེན་གྱི་སྡེ་ཚན་དེ་དག་གིས་དགེ་བསྙེན་དེ་ལ་སྨྲས་པ།
en: “The group of lay vow holders said,

source: དེ་ལྟར་བདག་ཅག་ནི་དགེ་སློང་རྣམས་ཀྱིས་བསྐྲད་དུ་རུང་ན་ཁྱོད་ལྟ་བུ་མང་དུ་ཐོས་པ། རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བ་ཡིན་ན་ཅི་སྟེ་བསྐྲད་ཅེས་ཟེར་ནས
en: ‘The monks can send us away like that, but why should they send away a learned proponent of the Dharma with all the eloquence of wisdom and freedom, such as you?

source: དེ་དག་དེ་ལ་མཁས་པར་འཛིན་པ་གང་ཡིན་པ་དེ་མེད་པར་གྱུར་ཏོ། །
en: None among them is as erudite as you are.’

source: དེ་ནས་དགེ་བསྙེན་དེ་གཞི་དེས་ཁྲོས་ནས། དེས་དགེ་སློང་རྣམས་ལ་སྨྲས་པ།
en: “This angered the lay vow holder and he shouted at the monks,

source: ངས་ནི་འཕྱེ་བོ་ཁྲི་ལ་འདུག་པ་ཁྱེད་རྣམས་ལ་ཅི་རྙེད་པ་བསྒྲུབས་ཏེ་
en: ‘You all perch on your thrones as if you were disabled!

source: བྱིན་ན་ཁྱེད་ཀྱིས་ནི་བདག་གཅིག་པུ་ལ་མི་ཟེར་བར་མང་པོའི་ནང་དུ་དམའ་ཕབ་བོ་ཞེས་བྱས་སོ། །
en: Everything I earn I give to you, and now you’ve disgraced me in public without so much as a word to me personally!’

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བསམས་པ།
en: “The monks thought,

source: ཉོན་མོངས་འདི་ནི་དམས་ཤིང་ཉམས་པར་གྱུར་ཏོ་སྙམ་ནས་
en: ‘This emotionally afflicted person has become quite abased,’

source: དགེ་བསྙེན་དེ་ལ་སྨྲས་པ།
en: and they said to the lay vow holder,

source: དགེ་བསྙེན་ཁྱོད་ཀྱིས་ཚིག་རྩུབ་པོ་སྨྲས་ཀྱིས། ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: ‘You must confess the mistake you’ve made by speaking harshly to us.

source: ལས་དེའི་འབྲས་བུ་མི་སྡུག་པ་མྱོང་བར་གྱུར་ཏ་རེ་ཞེས་བྱས་སོ། །
en: Otherwise your actions are sure to bring an ugly result.’

source: དེ་ནས་དགེ་བསྙེན་དེ་ཡང་འགྱོད་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: “The lay vow holder was flooded with regret.

source: ཡོན་གནས་འདི་ལྟ་བུ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པ་ནི་བདག་གིས་མ་ལེགས་པར་བྱས་སོ་སྙམ་སྟེ།
en: He said, ‘It was wrong for me to speak harshly to ones so worthy of offerings.’

source: ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་ནས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ།
en: He confessed his mistake, gave gifts and made merit,

source: ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་ཀྱང་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: went for refuge, and maintained the fundamental precepts all his life. “At the time of his death, he prayed,

source: ཀྱེ་མ་འདི་ལྟར་བདག་གིས་སེམས་ཅན་དག་པ་འདི་ལྟ་བུ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་འདི་བདག་ལ་འོང་བར་མ་གྱུར་ཅིག །
en: ‘Oh, in this way may I not meet with the results of the wrongful act of speaking harshly to such pure beings.

source: དེ་སྟེ་ཡང་ལས་འདིའི་འབྲས་བུ་གདོན་མི་ཟ་བར་བདག་ལ་སྨིན་པར་གྱུར་ན་ཡང་རབ་ཏུ་འབྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བདག་གི་བཀྲ་མི་ཤིས་པ་མེད་པར་གྱུར་ཏེ། བཀྲ་ཤིས་པར་གྱུར་ཅིག །
en: Should the results of that action ripen to me, then as soon as I feel a sense of renunciation, may that misfortune vanish and may I be fortunate instead.

source: བདག་གིས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་བཀུར་སྟི་བྱས་པ་དང་། སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་པ་དང་། ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་པའི་དགེ་བའི་རྩ་བ་འདིས་ན་བདག་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེན་པོའི་རིགས་སུ་སྐྱེ་བར་ཤོག་ཤིག །
en: May I serve the Buddha, Dharma, and Saṅgha, give gifts and make merit, go for refuge, and maintain the fundamental precepts all my life. By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: འཇིག་རྟེན་ན་བདག་གི་མིང་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བཀྲ་ཤིས་སུ་གྱུར་ཅིག །
en: May my name be auspicious the world over.

source: བདག་གིས་ཅི་བསམས་པ་དང་། ཅི་འདོད་པ་དེ་དག་ཐམས་ཅད་འབྱོར་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May all my intentions and all my wishes be successfully fulfilled.’

source: དེའི་ཚེ་དགེ་བསྙེན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་འཕྱེ་བོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that lay vow holder then is none other than Paṅgu.

source: དེས་དགེ་སློང་དེ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པས། ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ཚེ་རབས་ལྔ་བརྒྱར་འཕྱེ་བོར་གྱུར་ཏོ། །
en: The act of speaking harshly to the monks ripened such that for five hundred lives he was a paraplegic.

source: དེས་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ཏེ། ཚེ་གཅིག་ཏུ་སྐྱབས་སུ་འགྲོ་བ་དང་། བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: The acts of giving gifts and making merit, taking refuge, maintaining the fundamental precepts all his life, and praying at the time of his death ripened such that wherever he was born, it was into a family of great means, prosperity, and wealth;

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བཀྲ་ཤིས་སུ་གྱུར་ནས་འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ།
en: that his name became auspicious the world over; that he pleased me, and did not displease me;

source: རབ་ཏུ་འབྱུང་བའི་སེམས་བསྐྱེད་མ་ཐག་ཏུ་བཀྲ་མི་ཤིས་པ་མེད་པར་གྱུར་ཏེ། བཀྲ་ཤིས་པ་བྱུང་བར་གྱུར་ནས་
en: that as soon as he felt a sense of renunciation, his misfortune vanished and he became fortunate instead;

source: ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ།། །།
en: and that he went forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: གྲུམ་སྟོད་ཅེས་བྱ་བ་ནི།
en: Bhādra

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ནགས་ཁྲོད་ཅིག་ན་དྲང་སྲོང་ལྔ་བརྒྱ་ཙམ་གནས་ཏེ། དེ་དག་དེ་ན་འཁོད་ཅིང་མེའི་སྦྱིན་སྲེག་བྱེད་དོ། །
en: When the Blessed One was in Śrāvastī, deep in a certain forest there lived some five hundred sages who had settled down there to perform ritual fire pūjās.

source: སུ་ནི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་ཟིན་པ་ལས། ཡོངས་སུ་སྨིན་པར་བྱ།
en: Whom, having already produced roots of virtue, shall I lead to ripen their roots of virtue?

source: གདུལ་བར་བྱ་བའི་སྲས་རྣམས་ལ། །སངས་རྒྱས་དུལ་ལས་ཡོལ་བ་མེད། །
en: But when the time has come to tame Their offspring, buddhas never fail.

source: དྲང་སྲོང་ལྔ་བརྒྱ་པོ་རྣམས་གདུལ་བའི་དུས་ལ་བབ་བོ་སྙམ་དུ་དགོངས་ནས།
en: “The time has come to tame these five hundred sages,”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་མེའི་སྦྱིན་སྲེག་གི་ཐབ་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་དུ་སངས་རྒྱས་ཀྱི་ཞབས་ཀྱི་རྗེས་མཐོང་ལ།
en: whereupon the Blessed One performed a miracle that caused all five hundred sages to see evidence of the Buddha’s footprints all over the inside of the hearths they used for their ritual fire pūjās.

source: དེ་ཕྱིན་ཅད་མེ་སྦར་བར་མི་ནུས་པ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །དེ་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then they found they could not kindle their fires anymore, and they thought,

source: རྗེས་འདིའི་མཐུས་བདག་ཅག་གི་མེའི་ཐབ་རྣམས་ཀྱི་ནང་དུ་མེ་སྦར་མི་ནུས་པར་གྱུར་པ་ལས་ན།
en: “It’s by the might of these footprints that we can’t kindle a fire in these hearths.

source: རྗེས་འདི་ནི་དགེ་བ་ཞིག་ཡིན་པ་འདྲ་སྟེ། རྗེས་འདི་ལྷ་ཆེན་པོའི་རྗེས་མ་ཡིན་གྲང་སྙམ་ནས།
en: It seems that these footprints must somehow be auspicious—are these the footprints of Mahā­deva ?”

source: དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་རྗེས་དེ་དག་ལ་བསྲེག་བྱ་ཕུལ་ནས།
en: All five hundred sages offered those things intended for the sacrificial fire to the footprints of the Buddha,

source: སངས་རྒྱས་ཀྱི་མཐུས་སྦྱིན་སྲེག་དེ་དག་རང་སྦར་བར་གྱུར་ཏེ། མེ་ལྕེ་ཚངས་པའི་འཇིག་རྟེན་དུ་ཐུག་པར་སོང་ངོ་། །
en: and by the power of the Buddha the offerings burst into flames that reached all the way up to Brahmāloka.

source: དེ་ནས་དྲང་སྲོང་རྣམས་ཀྱིས་དེ་མཐོང་ནས་ཡ་མཚན་དུ་གྱུར་ཏེ།
en: The sages were amazed at the sight, and they thought,

source: ལྷ་ཆེན་པོས་བདག་ཅག་ལ་དགོངས་སོ་སྙམ་མོ། །
en: “ Mahā­deva thinks of us.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་དྲང་བའི་ཕྱིར། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ལ་ཐུག་པའི་བར་དུ་ཞབས་ཀྱི་རྗེས་གཅིག་ནས་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་སོ། །
en: To guide them, the Blessed One then performed a miracle that caused the footprints to lead, one after another, into the garden of Prince Jeta.

source: དེ་ནས་དྲང་སྲོང་དེ་དག་གིས། མེའི་སྦྱིན་སྲེག་གི་དྲུང་ནས་རྗེས་གཅིག་ནས་གཅིག་ཏུ་སྤྲུལ་པ་མཐོང་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The sages saw the emanated footprints, one after another, leading away from their ritual fire pūjās, and thought,

source: ལྷ་ཆེན་པོ་ནི་ལམ་འདིར་གཤེགས་སོ་སྙམ་ནས་
en: “ Mahā­deva went this way!”

source: ཞབས་ཀྱི་རྗེས་གཅིག་ནས་གཅིག་ཏུ་རྗེས་དེ་དག་ལ་མཆོད་པ་བྱེད་ཅིང་དོང་ནས།
en: They followed one footprint after another, making offerings as they went,

source: དེ་དག་མཐར་གྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཞུགས་སོ། །
en: until eventually they entered the garden of Prince Jeta,

source: དེ་ནས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ། མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ། བློ་གསལ་ཞིང་དྲི་མ་མེད་པ་རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: The five hundred sages saw the Blessed Buddha from a distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས་དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ནི། ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འཁོད་དོ། །
en: After they saw him they approached the Blessed One, touched their heads to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their thoughts, habitual tendencies, temperaments, capacities, and natures, and taught them the Dharma accordingly.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས། སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After seeing the truths they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and requested the Blessed One,

source: བཙུན་པ་བདག་ཅག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted we wish to go forth in the Dharma and Vinaya so well spoken, complete our novitiates, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས། དེ་རྣམས་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་རྣམས་ཀྱིས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་འདི་རྣམས་ལ་ཞབས་ཀྱི་རྗེས་བསྟན་པས་དྲངས་ཏེ་རབ་ཏུ་ཕྱུང་ནས། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed Buddha, “tell us why, by showing the sages the footprints, the Blessed One led them to go forth and established them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཇི་ལྟར་ཞབས་ཀྱི་རྗེས་བསྟན་པས་དྲངས་ཏེ་རབ་ཏུ་ཕྱུང་ནས། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དུ་བཅུག་པ་དེ་ཉོན་ཅིག་
en: “Not only now,” the Blessed One explained, “but in times past as well, with footprints I led these five hundred sages to go forth, whereupon they practiced pure conduct all their lives. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་། ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེར་གང་གི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་པ་དེའི་ཚེ་དེས་སྐྱེ་བོ་ཕྱི་མ་རྣམས་ལ་ཐུགས་བརྩེ་བ་དང་། དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་དྲང་བའི་ཕྱིར། རྟགས་སུ་རུང་བའི་སངས་རྒྱས་ཀྱི་ཞབས་ཀྱི་རྗེས་བྱིན་གྱིས་བརླབས་སོ། །
en: the totally and completely awakened Buddha Kāśyapa put on a great display of miracles. Out of compassion for people in times to come, and so that he might lead the five hundred sages, he performed a miracle that caused them to take the appearance of the Buddha’s footprints as a sign.

source: དེའི་ཚེ་ན་ལྷོ་ཕྱོགས་ན་དཀའ་ཐུབ་ཀྱི་ནགས་ཤིག་ན་དྲང་སྲོང་ལྔ་བརྒྱ་ཙམ་གནས་པ་དེ་དག་སྟེང་གི་བར་སྣང་ལས་རི་སྤོས་ཀྱི་ངད་ལྡང་བ་ལ་ཆས་ཏེ། དོང་བ་ལས་དེ་དག་རི་རབ་ལ་རྡུགས་པ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞབས་ཀྱི་རྗེས་རྣམས་ཀྱི་སྟེང་དུ་རྡུགས་ནས་དེ་རྣམས་ཡ་མཚན་དུ་གྱུར་ཏེ།
en: “At that time in the south, there were some five hundred sages living in a certain forest for practicing austerities. As they traveled through the heavens above the footprints of the Blessed Buddha to Gandhamādana Mountain, they were amazed to find themselves unable to go any farther, as if obstructed by Mount Sumeru itself.

source: བདག་ཅག་རྫུ་འཕྲུལ་ཡང་མ་ཉམས་ལ།
en: ‘Our miraculous powers have not waned,’ they thought.

source: ནམ་མཁའ་ལ་ཡང་ཐོགས་པར་གྱུར་ཏོ་སྙམ་མོ། །
en: ‘How can it be we are obstructed in the sky?’

source: དེ་ནས་དེ་དག་ལ་དགའ་བའི་ལྷས། དེ་དག་ལ་སྨྲས་པ།
en: “A god who was fond of them explained,

source: ཁྱེད་ནི་རྫུ་འཕྲུལ་མ་ཉམས་མོད་ཀྱི། ཁྱེད་ཀྱི་འོག་ན་སངས་རྒྱས་ཀྱི་ཞབས་ཀྱི་རྗེས་ཡོད་ལ་
en: ‘Though your miraculous powers have not waned, far below you are footprints of the Buddha.

source: དེའི་སྟེང་དུ་ནི་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་པས་ཀྱང་འགྲོ་མི་ནུས་སོ། །
en: Beyond them even Śakra and Brahmā cannot pass.’

source: དེ་ནས་དྲང་སྲོང་དེ་རྣམས་ཞབས་ཀྱི་རྗེས་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: The sages took great delight in the footprints.

source: དགའ་བར་གྱུར་ནས་ས་ལ་བབས་ཏེ། ཞབས་ཀྱི་རྗེས་དེ་དག་ལ་བཀུར་སྟི་བྱེད་པ་ལ་ཞུགས་སོ། །
en: In their joy they descended to the earth and began to venerate the footprints.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་དེ་རྣམས་དྲང་བའི་ཕྱིར། དྲང་སྲོང་གནས་པ་ལ་ཐུག་པའི་བར་དུ་ཞབས་ཀྱི་རྗེས་གཅིག་ནས་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་ནས། དྲང་སྲོང་རྣམས་ཀྱིས་བསམས་པ།
en: To lead them, the totally and completely awakened Buddha Kāśyapa performed a miracle that caused the footprints to float up one by one to where the sages were hovering, and the sages thought,

source: རྗེས་འདི་དག་ནི་ལྷ་ཆེན་པོའི་ཡིན་ཏེ། འདི་ནི་ལམ་འདིར་གཤེགས་སོ་
en: ‘These footprints belong to Mahā­deva . He went this way!’

source: སྙམ་ནས། རྗེས་དེ་ཐོག་ཐག་ཏུ་དྲང་སྲོང་གནས་པར་དོང་ནས། དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་མཐོང་ངོ་། །
en: Thinking this, the sages began following the footprints, and then all five hundred sages saw the totally and completely awakened Buddha Kāśyapa from a distance.
